package primitives;

public class Primitives {
    /**
      *  byte - Хранит в себе целые числа от -128 до 127 (8 бит или 1 байт).
     */
    byte a;


    /**
     *  short - Хранит в себе целые числа от -32_768 до 32_767 (16 бит или 2 байта).
     **/
    short b;

    /**
     *  int - Хранит в себе целые числа от -2_147_483_648 до 2_147_483_647 (32 бита или 4 байта).
     */
    int c;

    /**
     *  long - Хранит в себе целые числа –9 223 372 036 854 775 808 до 9 223 372 036 854 775 807
     *  (64 бита или 8 байт)
     */
    long d;

    /**
     * double - Хранит числа с плавающей точкой. Около 15 знаков после точки (64 бита или 8 байт).
     */
    double aDouble = 1.00555555;

    /**
     * float - Хранит числа с плавающей точкой. Около 7 знаков после точки (32 бита или 4 байта).
     */
    float aFloat = 1.05f;

    /**
     * char - Хранит в себе один символ.
     */
    char aChar = 'f';
}
